//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Stap %d van %d wordt uitgevoerd: entiteitenopslag wordt gegenereerd";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Stap %d van %d wordt uitgevoerd: bootstrapdatabase wordt gecreëerd.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Stap %d van %d wordt uitgevoerd: database aanvraagwachtrij wordt gecreëerd";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Stap %d van %d wordt uitgevoerd: entiteitenopslag wordt gedownload. Tot nu toe %s van %s ontvangen.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Stap %d van %d wordt uitgevoerd: verlopen aanvragen worden verwijderd";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Stap %d van %d wordt uitgevoerd: metagegevens worden geladen";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Stap %d van %d wordt uitgevoerd: aanvraagwachtrij wordt samengevoegd";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Stap %d van %d wordt uitgevoerd: transacties worden samengevoegd";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Stap %d van %d wordt uitgevoerd: creëren en verwijderen wordt samengevoegd";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Stap %d van %d wordt uitgevoerd: query's %s worden gedefinieerd met %s ";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Stap %d van %d wordt uitgevoerd: aanvragen worden verwerkt. Aanpassingsaanvraag %s van %s wordt verzonden.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Stap %d van %d wordt uitgevoerd: wijzigingen worden opnieuw toegepast";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Stap %d van %d wordt uitgevoerd: ontvangen gegevens worden geanalyseerd";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Stap %d van %d wordt uitgevoerd: gegevens worden ontvangen van de server. Tot nu toe %s ontvangen.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Stap %d van %d wordt uitgevoerd: verwijderde relaties worden gewist";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Stap %d van %d wordt uitgevoerd: als RemoveAfterUpload aangegeven aanvragen worden verwijderd";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Stap %d van %d wordt uitgevoerd: gegevens worden naar de server verzonden. Tot nu toe %s verzonden.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Stap %d van %d wordt uitgevoerd: database entiteitsopslag wordt verzonden. Tot nu toe %s van %s verzonden.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Stap %d van %d wordt uitgevoerd: database aanvraagwachtrij wordt verzonden. Tot nu toe %s van %s verzonden.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Stap %d van %d wordt uitgevoerd: communicatie met de server wordt gestart.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Stap %d van %d wordt uitgevoerd: aanvragen worden voorbewerkt voor uploaden";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Stap %d van %d wordt uitgevoerd: er wordt gewacht op download";

